### `Q-1:` Write a program to create an empty series.

In [4]:
import pandas as pd
import numpy as np

es = pd.Series()
es

Series([], dtype: object)

### `Q-2:` Write a Pandas program to add, subtract, multiple and divide two Pandas Series.

In [9]:
import pandas as pd

# Creating two Series
series1 = pd.Series([10, 20, 30, 40, 50])
series2 = pd.Series([1, 2, 3, 4, 5])

# Addition
addition = series1 + series2

# Subtraction
subtraction = series1 - series2

# Multiplication
multiplication = series1 * series2

# Division
division = series1 / series2

# Display the results
print("Series 1:")
print(series1)

print("\nSeries 2:")
print(series2)

print("\nAddition:")
print(addition)

print("\nSubtraction:")
print(subtraction)

print("\nMultiplication:")
print(multiplication)

print("\nDivision:")
print(division)

Series 1:
0    10
1    20
2    30
3    40
4    50
dtype: int64

Series 2:
0    1
1    2
2    3
3    4
4    5
dtype: int64

Addition:
0    11
1    22
2    33
3    44
4    55
dtype: int64

Subtraction:
0     9
1    18
2    27
3    36
4    45
dtype: int64

Multiplication:
0     10
1     40
2     90
3    160
4    250
dtype: int64

Division:
0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64

### `Q-3` Write a Pandas program to compare the elements of the two Pandas Series.
Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 10]

In [10]:
import pandas as pd

# Define the two Series
series1 = pd.Series([2, 4, 6, 8, 10])
series2 = pd.Series([1, 3, 5, 7, 10])

# Compare the elements
print("Series 1:")
print(series1)

print("\nSeries 2:")
print(series2)

print("\nElement-wise Comparison:")

# Equal
print("\nEqual:")
print(series1 == series2)

# Greater than
print("\nGreater than:")
print(series1 > series2)

# Less than
print("\nLess than:")
print(series1 < series2)

Series 1:
0     2
1     4
2     6
3     8
4    10
dtype: int64

Series 2:
0     1
1     3
2     5
3     7
4    10
dtype: int64

Element-wise Comparison:

Equal:
0    False
1    False
2    False
3    False
4     True
dtype: bool

Greater than:
0     True
1     True
2     True
3     True
4    False
dtype: bool

Less than:
0    False
1    False
2    False
3    False
4    False
dtype: bool

### `Q-5.`Write a function to change the data type of given a column or a Series. Function takes series and data type as input, returns the converted series.
```
series = pd.Series([1,2,'Python', 2.0, True, 100])
change to float type data
```
Note: Read about pd.to_numeric()

In [11]:
import pandas as pd

def change_dtype(series, dtype):
    """
    Convert a Pandas Series to the specified data type using pd.to_numeric for numeric types.
    
    Parameters:
    series (pd.Series): Input Pandas Series
    dtype: Desired data type (e.g., float, int)
    
    Returns:
    pd.Series: Series with converted data type
    """
    try:
        if dtype in [float, int]:
            # Use pd.to_numeric to handle conversion to numeric types, coercing errors to NaN
            return pd.to_numeric(series, errors='coerce').astype(dtype)
        else:
            # For non-numeric types, use astype directly
            return series.astype(dtype)
    except Exception as e:
        print(f"Error converting to {dtype}: {e}")
        return series

# Example usage
series = pd.Series([1, 2, 'Python', 2.0, True, 100])
converted_series = change_dtype(series, float)
print(converted_series)

0      1.0
1      2.0
2      NaN
3      2.0
4      1.0
5    100.0
dtype: float64

Download data - https://drive.google.com/file/d/1LRhXwbEodeWXtzPhJCX0X9Lf_BECzvqb/view?usp=share_link
All Batsman runs series in IPL 2008 to 2022.

Below questions are based on this data.

### `Q-6` Find top 10 most run getter from the series.

In [19]:
import pandas as pd

# Load the data
runs = pd.read_csv('batsman_runs_ipl.csv', index_col='batter')

# Sort in-place
runs.sort_values(by='batsman_run', ascending=False, inplace=True)

# Display top 10
print(runs.head(10))

                batsman_run
batter
V Kohli                6634
S Dhawan               6244
DA Warner              5883
RG Sharma              5881
SK Raina               5536
AB de Villiers         5181
CH Gayle               4997
MS Dhoni               4978
RV Uthappa             4954
KD Karthik             4377

### `Q-7` No of players having runs above 3000

In [23]:
import pandas as pd

# Load the data
runs = pd.read_csv('batsman_runs_ipl.csv', index_col='batter')

# Filter players who scored more than 3000 runs
filtered_runs = runs[runs['batsman_run'] > 3000].count()

# Display result
print(filtered_runs)

batsman_run    20
dtype: int64

### `Q-8` No of players having runs above mean value?

In [24]:
import pandas as pd
import numpy as np
# Load the data
runs = pd.read_csv('batsman_runs_ipl.csv', index_col='batter')
above_mean = runs[runs['batsman_run'] > np.mean(runs['batsman_run'])].count()
above_mean

batsman_run    128
dtype: int64

Download data - https://drive.google.com/file/d/1QZuZ5bypUInfVvarHACLAi8tXXHvb8xd/view?usp=share_link

file name - items.csv

### `Q-9`
    i. Read `items.csv` making `item_name` as index.
    ii. Show no of nan values
    ii. Item price is given in $, so convert it to rupees without currency symbol.
    iii. Make data type of newly made series as float.
    iv. Fill nan with mean of the series


How csv file looks

```
item_name	item_price
Chips and Fresh Tomato Salsa	$2.39
Izze	$3.39
Nantucket Nectar	$3.39
Chips and Tomatillo-Green Chili Salsa	$2.39
Chicken Bowl	$16.98

```

In [4]:
import pandas as pd

# i. Read `items.csv` making `item_name` as index
items = pd.read_csv('items.csv', index_col='item_name')
items

                                      item_price
item_name
Chips and Fresh Tomato Salsa              $2.39
Izze                                      $3.39
Nantucket Nectar                          $3.39
Chips and Tomatillo-Green Chili Salsa     $2.39
Chicken Bowl                             $16.98
...                                          ...
Steak Burrito                            $11.75
Steak Burrito                            $11.75
Chicken Salad Bowl                       $11.25
Chicken Salad Bowl                        $8.75
Chicken Salad Bowl                        $8.75

[4622 rows x 1 columns]

In [7]:

# ii. Show number of NaN values
na = items.isna().sum()
na

item_price    50
dtype: int64

In [8]:
# iii. Remove '$' symbol and convert to float
items['item_price'] = items['item_price'].str.replace('$', '', regex=False)
items

                                      item_price
item_name
Chips and Fresh Tomato Salsa               2.39
Izze                                       3.39
Nantucket Nectar                           3.39
Chips and Tomatillo-Green Chili Salsa      2.39
Chicken Bowl                              16.98
...                                          ...
Steak Burrito                             11.75
Steak Burrito                             11.75
Chicken Salad Bowl                        11.25
Chicken Salad Bowl                         8.75
Chicken Salad Bowl                         8.75

[4622 rows x 1 columns]

In [11]:
# iv. Convert data type to float
items['item_price'] = items['item_price'].astype(float)
items.dtypes

item_price    float64
dtype: object

In [13]:
# v. Fill NaN with mean of the series
mean_price = items['item_price'].mean()
items['item_price'].fillna(mean_price, inplace=True)
items

C:\Users\bhaut\AppData\Local\Temp\ipykernel_1352\2929257244.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  items['item_price'].fillna(mean_price, inplace=True)

                                       item_price
item_name
Chips and Fresh Tomato Salsa                 2.39
Izze                                         3.39
Nantucket Nectar                             3.39
Chips and Tomatillo-Green Chili Salsa        2.39
Chicken Bowl                                16.98
...                                           ...
Steak Burrito                               11.75
Steak Burrito                               11.75
Chicken Salad Bowl                          11.25
Chicken Salad Bowl                           8.75
Chicken Salad Bowl                           8.75

[4622 rows x 1 columns]